{
  "header": {
    "about": "Sobre",
    "experience": "Experiência",
    "contact": "Contato"
  },
  "whoAmI": {
    "hello": "Olá,",
    "thisIs": "Eu sou o",
    "leandro": "Leandro Cervantes",
    "im": "um",
    "professional": "Desenvolvedor de Software",
    "contactMe": "Entre em Contato",
    "getResume": "Baixe meu Currículo"
  },
  "about": {
    "label": "Sobre Mim",
    "text1": "Sou um desenvolvedor de software apaixonado por tecnologia, inovação e resolução de problemas. Com sólida experiência em desenvolvimento full-stack, atuo principalmente com ",
    "text2": ".NET Core, React e ASP.NET Core, integrando a equipe de arquitetura",
    "text3": ", onde contribuo para o design de soluções escaláveis e seguras. Valorizo a colaboração, a troca de conhecimento e estou sempre em busca de novos desafios que me permitam evoluir tecnicamente, aprender novas tecnologias e agregar valor aos projetos em que atuo."
  },
  "experience": {
    "label": "Experiência",
    "exp1": {
      "position": "Desenvolvedor Full-Stack Sênior",
      "company": "Função Sistemas",
      "year": "2019",
      "summary": "Como membro de uma equipe de arquitetura e inovação, contribuí diretamente para o planejamento e implementação de soluções estratégicas, utilizando conceitos avançados e tecnologias de ponta. Contribuições principais incluem:",
      "summaryItem1": "Desenhei e desenvolvi infraestrutura para novas aplicações e pacotes usando .NET Core, otimizando o ecossistema de microsserviços.",
      "summaryItem2": "Implementei arquiteturas para aplicações React e React Native, focando em escalabilidade e eficiência.",
      "summaryItem3": "Desenvolvi e integrei modelos de autenticação baseados em OAuth, garantindo segurança robusta para APIs e serviços.",
      "summaryItem4": "Desenhei integração de Single Sign-On (SSO) usando OpenID e Identity-Server, simplificando o acesso às aplicações.",
      "summaryItem5": "Implantei tecnologias modernas de distribuição com Docker e Kubernetes, melhorando a escalabilidade e automação.",
      "summaryItem6": "Configurei pipelines de CI/CD usando Azure DevOps, reduzindo os tempos de lançamento e melhorando os processos de implantação.",
      "summaryItem7": "Estruturei sistemas de mensagens com RabbitMQ, Azure Service Bus e Amazon MQ, suportando comunicação e processamento assíncronos."
    },
    "exp2": {
      "position": "Auxiliar Técnico",
      "company": "Smart Modular Technologies",
      "year": "2012",
      "summary": "Iniciei minha trajetória como Operador de Produção e, através de dedicação e melhoria contínua, fui promovido a Assistente Técnico. Ao longo dessa jornada, desenvolvi habilidades em análise de falhas, automação de processos, manutenção de hardware e software, além de criar projetos de melhoria para otimizar linhas de produção e operações. Contribuições principais incluem:",
      "summaryItem1": "Desenhei e desenvolvi um sistema para monitorar entrada/saída de módulos de memória, realizar análise de falhas com um simulador 2D e gerenciar armazenamento de scraps de memória DRAM.",
      "summaryItem2": "Desenvolvi um sistema automatizado de ordens de serviço baseado no status das máquinas e métricas de rendimento.",
      "summaryItem3": "Implementei uma solução de controle de yield para a área de testes de memória.",
      "summaryItem4": "Desenhei e implantei uma plataforma online para avaliações de funcionários e cursos de treinamento.",
      "summaryItem5": "Trabalhei com análise de falhas e retrabalho de módulos de memória DRAM.",
      "summaryItem6": "Forneci manutenção de hardware e software para testes de memória DRAM, testes de SSD, testes de módulos Bluetooth/Wi-Fi e linhas SMT, incluindo criação de projetos e melhorias de automação.",
      "summaryItem7": "Realizei manutenção em equipamentos de linha de montagem SMT, incluindo impressoras de tela DEK, SPI Koh Young, máquinas de colocação Fuji NXT e sistemas AOI Saki."
    }
  },
  "contact": {
    "label": "Entre em Contato",
    "address": "São Paulo, Brasil"
  },
  "skills": {
    "label": "Minhas Habilidades"
  },
  "thanks": {
    "label": "Obrigado pela visita!"
  }
}
